espressif/arduino-esp32/boards.txt
##############################################################

hornbill32dev.name=Hornbill ESP32 Dev

hornbill32dev.upload.tool=esptool
hornbill32dev.upload.maximum_size=1310720
hornbill32dev.upload.maximum_data_size=294912
hornbill32dev.upload.wait_for_upload_port=true

hornbill32dev.serial.disableDTR=true
hornbill32dev.serial.disableRTS=true

hornbill32dev.build.mcu=esp32
hornbill32dev.build.core=esp32
hornbill32dev.build.variant=hornbill32dev
hornbill32dev.build.board=HORNBILL_ESP32_DEV

hornbill32dev.build.f_cpu=240000000L
hornbill32dev.build.flash_mode=dio
hornbill32dev.build.flash_size=4MB
hornbill32dev.build.boot=bootloader

hornbill32dev.menu.FlashFreq.80=80MHz
hornbill32dev.menu.FlashFreq.80.build.flash_freq=80m
hornbill32dev.menu.FlashFreq.40=40MHz
hornbill32dev.menu.FlashFreq.40.build.flash_freq=40m

hornbill32dev.menu.UploadSpeed.921600=921600
hornbill32dev.menu.UploadSpeed.921600.upload.speed=921600
hornbill32dev.menu.UploadSpeed.115200=115200
hornbill32dev.menu.UploadSpeed.115200.upload.speed=115200
hornbill32dev.menu.UploadSpeed.256000.windows=256000
hornbill32dev.menu.UploadSpeed.256000.upload.speed=256000
hornbill32dev.menu.UploadSpeed.230400.windows.upload.speed=256000
hornbill32dev.menu.UploadSpeed.230400=230400
hornbill32dev.menu.UploadSpeed.230400.upload.speed=230400
hornbill32dev.menu.UploadSpeed.460800.linux=460800
hornbill32dev.menu.UploadSpeed.460800.macosx=460800
hornbill32dev.menu.UploadSpeed.460800.upload.speed=460800
hornbill32dev.menu.UploadSpeed.512000.windows=512000
hornbill32dev.menu.UploadSpeed.512000.upload.speed=512000

##############################################################

hornbill32minima.name=Hornbill ESP32 Minima

hornbill32minima.upload.tool=esptool
hornbill32minima.upload.maximum_size=1310720
hornbill32minima.upload.maximum_data_size=294912
hornbill32minima.upload.wait_for_upload_port=true

hornbill32minima.serial.disableDTR=true
hornbill32minima.serial.disableRTS=true

hornbill32minima.build.mcu=esp32
hornbill32minima.build.core=esp32
hornbill32minima.build.variant=hornbill32minima
hornbill32minima.build.board=HORNBILL_ESP32_MINIMA
hornbill32minima.build.f_cpu=240000000L
hornbill32minima.build.flash_mode=dio
hornbill32minima.build.flash_size=4MB
hornbill32minima.build.boot=bootloader

hornbill32minima.menu.FlashFreq.80=80MHz
hornbill32minima.menu.FlashFreq.80.build.flash_freq=80m
hornbill32minima.menu.FlashFreq.40=40MHz
hornbill32minima.menu.FlashFreq.40.build.flash_freq=40m

hornbill32minima.menu.UploadSpeed.921600=921600
hornbill32minima.menu.UploadSpeed.921600.upload.speed=921600
hornbill32minima.menu.UploadSpeed.115200=115200
hornbill32minima.menu.UploadSpeed.115200.upload.speed=115200
hornbill32minima.menu.UploadSpeed.256000.windows=256000
hornbill32minima.menu.UploadSpeed.256000.upload.speed=256000
hornbill32minima.menu.UploadSpeed.230400.windows.upload.speed=256000
hornbill32minima.menu.UploadSpeed.230400=230400
hornbill32minima.menu.UploadSpeed.230400.upload.speed=230400
hornbill32minima.menu.UploadSpeed.460800.linux=460800
hornbill32minima.menu.UploadSpeed.460800.macosx=460800
hornbill32minima.menu.UploadSpeed.460800.upload.speed=460800
hornbill32minima.menu.UploadSpeed.512000.windows=512000
hornbill32minima.menu.UploadSpeed.512000.upload.speed=512000

##############################################################

firebeetle32.name=FireBeetle-ESP32

firebeetle32.upload.tool=esptool
firebeetle32.upload.maximum_size=1310720
firebeetle32.upload.maximum_data_size=294912
firebeetle32.upload.wait_for_upload_port=true

firebeetle32.serial.disableDTR=true
firebeetle32.serial.disableRTS=true

firebeetle32.build.mcu=esp32
firebeetle32.build.core=esp32
firebeetle32.build.variant=firebeetle32
firebeetle32.build.board=ESP32_DEV

firebeetle32.build.f_cpu=240000000L
firebeetle32.build.flash_mode=dio
firebeetle32.build.flash_size=4MB
firebeetle32.build.boot=bootloader

firebeetle32.menu.FlashFreq.80=80MHz
firebeetle32.menu.FlashFreq.80.build.flash_freq=80m
firebeetle32.menu.FlashFreq.40=40MHz
firebeetle32.menu.FlashFreq.40.build.flash_freq=40m

firebeetle32.menu.UploadSpeed.921600=921600
firebeetle32.menu.UploadSpeed.921600.upload.speed=921600
firebeetle32.menu.UploadSpeed.115200=115200
firebeetle32.menu.UploadSpeed.115200.upload.speed=115200
firebeetle32.menu.UploadSpeed.256000.windows=256000
firebeetle32.menu.UploadSpeed.256000.upload.speed=256000
firebeetle32.menu.UploadSpeed.230400.windows.upload.speed=256000
firebeetle32.menu.UploadSpeed.230400=230400
firebeetle32.menu.UploadSpeed.230400.upload.speed=230400
firebeetle32.menu.UploadSpeed.460800.linux=460800
firebeetle32.menu.UploadSpeed.460800.macosx=460800
firebeetle32.menu.UploadSpeed.460800.upload.speed=460800
firebeetle32.menu.UploadSpeed.512000.windows=512000
firebeetle32.menu.UploadSpeed.512000.upload.speed=512000

##############################################################

intorobot-fig.name=IntoRobot Fig

intorobot-fig.upload.tool=esptool
intorobot-fig.upload.maximum_size=1310720
intorobot-fig.upload.maximum_data_size=294912
intorobot-fig.upload.wait_for_upload_port=true

intorobot-fig.serial.disableDTR=true
intorobot-fig.serial.disableRTS=true

intorobot-fig.build.mcu=esp32
intorobot-fig.build.core=esp32
intorobot-fig.build.variant=intorobot-fig
intorobot-fig.build.board=INTOROBOT_ESP32_DEV

intorobot-fig.build.f_cpu=240000000L
intorobot-fig.build.flash_mode=dio
intorobot-fig.build.flash_size=4MB
intorobot-fig.build.boot=bootloader

intorobot-fig.menu.FlashFreq.80=80MHz
intorobot-fig.menu.FlashFreq.80.build.flash_freq=80m
intorobot-fig.menu.FlashFreq.40=40MHz
intorobot-fig.menu.FlashFreq.40.build.flash_freq=40m

intorobot-fig.menu.UploadSpeed.921600=921600
intorobot-fig.menu.UploadSpeed.921600.upload.speed=921600
intorobot-fig.menu.UploadSpeed.115200=115200
intorobot-fig.menu.UploadSpeed.115200.upload.speed=115200
intorobot-fig.menu.UploadSpeed.256000.windows=256000
intorobot-fig.menu.UploadSpeed.256000.upload.speed=256000
intorobot-fig.menu.UploadSpeed.230400.windows.upload.speed=256000
intorobot-fig.menu.UploadSpeed.230400=230400
intorobot-fig.menu.UploadSpeed.230400.upload.speed=230400
intorobot-fig.menu.UploadSpeed.460800.linux=460800
intorobot-fig.menu.UploadSpeed.460800.macosx=460800
intorobot-fig.menu.UploadSpeed.460800.upload.speed=460800
intorobot-fig.menu.UploadSpeed.512000.windows=512000
intorobot-fig.menu.UploadSpeed.512000.upload.speed=512000

